Repository: Canary330/KeyGuard
Catalog: KeyGuard/Localizable.xcstrings
Source language: zh_hans
Languages: en, zh_hk

source: ⌘⇧S 当作截图：已关闭
en: ⌘⇧S as Screenshot: Off
zh_hk: ⌘⇧S 當作截圖：已關閉

source: ⌘⇧S 当作截图：已开启
en: ⌘⇧S as Screenshot: On
zh_hk: ⌘⇧S 當作截圖：已開啟

source: 下一步
en: Next

source: 仍要添加
en: Add Anyway
zh_hk: 仍要新增

source: 使用方法
en: How to Use

source: 全局拦截需要在「系统设置 → 隐私与安全性 → 辅助功能」中开启本应用。
en: Enable this app under System Settings → Privacy & Security → Accessibility for global blocking.
zh_hk: 全域攔截須在「系統設定 → 隱私權與安全性 → 輔助使用」中開啟本應用程式。

source: 前往「系统设置」授权辅助功能以启用全局拦截
en: Open “System Settings” to grant Accessibility access for global blocking
zh_hk: 前往「系統設定」授權輔助使用以啟用全域攔截

source: 前往设置
en: Open Settings
zh_hk: 前往設定

source: 加入列表的快捷键将在所有应用中失效（系统级拦截）。首次使用需在「系统设置 → 隐私与安全性 → 辅助功能」中授权本应用。
en: Shortcuts in the list will be disabled in all apps (system-wide). First-time use: grant this app access under “System Settings → Privacy & Security → Accessibility”.
zh_hk: 加入列表的快捷鍵將在所有應用程式中失效（系統級攔截）。首次使用需在「系統設定 → 私隱與安全性 → 輔助使用」中授權本應用程式。

source: 取消
en: Cancel

source: 在下方设置中开启需要的开关，或添加要全局禁用的快捷键。首次使用需在「系统设置 → 隐私与安全性 → 辅助功能」中授权本应用，才能生效。
en: Turn on the options you need below, or add shortcuts to disable globally. Grant this app access under “System Settings → Privacy & Security → Accessibility” for it to take effect.
zh_hk: 在下方設定中開啟需要的開關，或新增要全域停用的快捷鍵。首次使用需在「系統設定 → 私隱與安全性 → 輔助使用」中授權本應用程式，才能生效。

source: 好的
en: OK

source: 已开启
en: Enabled
zh_hk: 已開啟

source: 未开启
en: Disabled
zh_hk: 未開啟

source: 本应用的目的
en: What This App Does
zh_hk: 本應用程式的目的

source: 欢迎使用 KeyGuard
en: Welcome to KeyGuard
zh_hk: 歡迎使用 KeyGuard

source: 添加单个字母、数字或空格等按键可能影响输入法与正常输入，请确认是否仍要添加。
en: Disabling a single letter, number, or space key may affect input methods and typing. Confirm that you still want to add it.
zh_hk: 新增單一字母、數字或空格等按鍵可能影響輸入法與正常輸入，請確認是否仍要新增。

source: 添加要禁用的快捷键…
en: Add shortcut to disable…
zh_hk: 新增要停用的快捷鍵…

source: 知道了
en: Got it

source: 禁止 ⌘Q 退出：已关闭
en: Block ⌘Q Quit: Off
zh_hk: 禁止 ⌘Q 結束：已關閉

source: 禁止 ⌘Q 退出：已开启
en: Block ⌘Q Quit: On
zh_hk: 禁止 ⌘Q 結束：已開啟

source: 自定义全局禁用快捷键
en: Custom Global Shortcuts
zh_hk: 自訂全域停用快捷鍵

source: 设置…
en: Settings…
zh_hk: 設定…

source: 请按下要禁用的快捷键…
en: Press the shortcut to disable…
zh_hk: 請按下要停用的快捷鍵…

source: 退出 KeyGuard
en: Quit KeyGuard
zh_hk: 結束 KeyGuard

source: 防止误触：由于 macos 的某些快捷键会导致工作时频繁的误点击，本应用设计的理念是避免误按 ⌘Q 退出应用、⌘W 关闭窗口、⌘H 隐藏、⌘M 最小化等快捷键，导致工作被打断或未保存内容丢失。
en: Prevent accidents: avoid unintended ⌘Q quit, ⌘W close window, ⌘H hide, ⌘M minimize, etc., so work isn’t interrupted or unsaved content lost.
zh_hk: 防止誤觸：避免誤按 ⌘Q 結束應用程式、⌘W 關閉視窗、⌘H 隱藏、⌘M 最小化等快捷鍵，導致工作中斷或未儲存內容遺失。

source: 需要辅助功能权限
en: Accessibility Permission Required
zh_hk: 需要輔助功能權限

source: 须在「系统设置 → 隐私与安全性 → 辅助功能」中开启本应用，全局拦截才会生效。
en: Enable this app under System Settings → Privacy & Security → Accessibility for global blocking to take effect.
zh_hk: 須在「系統設定 → 隱私權與安全性 → 輔助使用」中開啟本應用程式，全域攔截才會生效。

source: 禁止 ⌘Q 退出应用
en: Block ⌘Q Quit
zh_hk: 禁止 ⌘Q 結束應用程式

source: 禁止 ⌘W 关闭窗口
en: Block ⌘W Close Window
zh_hk: 禁止 ⌘W 關閉視窗

source: 禁止 ⌘H 隐藏应用
en: Block ⌘H Hide App
zh_hk: 禁止 ⌘H 隱藏應用程式

source: 禁止 ⌘M 最小化窗口
en: Block ⌘M Minimize Window
zh_hk: 禁止 ⌘M 最小化視窗

source: 将 ⌘⇧S 当作系统截图（同 ⌘⇧5）
en: Use ⌘⇧S as System Screenshot (same as ⌘⇧5)
zh_hk: 將 ⌘⇧S 當作系統截圖（同 ⌘⇧5）

source: 辅助功能权限
en: Accessibility Permission
zh_hk: 輔助功能權限

source: 运行时不显示在程序坞
en: Hide from Dock when running
zh_hk: 執行時不顯示在程式塢
